app/Filament/Resources/OrderResource/Widgets/OrderStats.php

select count(*) as aggregate from `orders` where `status` = 'new'
select count(*) as aggregate from `orders` where `status` = 'processing'
select count(*) as aggregate from `orders` where `status` = 'shipped'
select avg(`grand_total`) as aggregate from `orders`
---
    protected function getStats(): array
    {
        return [
            Stat::make('New Order', Order::query()->where('status', 'new')->count()),
            Stat::make('Order Processing', Order::query()->where('status', 'processing')->count()),
            Stat::make('Order Shipped', Order::query()->where('status', 'shipped')->count()),
            // Stat::make('Average Price', Number::currency(Order::query()->avg('grand_total'), 'IDR')),
            Stat::make('Average Price', Number::currency(Order::query()->avg('grand_total') ?? 0, 'IDR')),
        ];